---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartExcludedPartWarning
source: html/536ef769-18fb-9bc0-6731-69dd93904e61.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartExcludedPartWarning Property

There were fabrication parts needed to the make the connection that were excluded from the fabrication service causing the connection to fail. You may try to inlcude these fitting(s) and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartExcludedPartWarning { get; }
```